import streamlit as st

def run():
    st.title("Що таке рак легенів?")
    st.write(
        """
        Рак легенів — це злоякісна пухлина, що розвивається в тканинах одного або обох легень.  
        Головні фактори ризику:
        - **Куріння** (більшість випадків)  
        - **Вдихання шкідливих речовин** (азбест, радон тощо)  
        - **Хронічні запальні захворювання легенів**  

        Раннє виявлення значно підвищує шанси на успішне лікування.  
        Наш додаток допоможе Вам зрозуміти, чи варто звернутися до лікаря для додаткових обстежень.
        """
    )

run()